espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_aux_sce.h
/******************************************************************************
*  Filename:       hw_aux_sce_h
*  Revised:        $Date$
*  Revision:       $Revision$
*
* Copyright (c) 2015 - 2017, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_AUX_SCE_H__
#define __HW_AUX_SCE_H__

//*****************************************************************************
//
// This section defines the register offsets of
// AUX_SCE component
//
//*****************************************************************************
// Internal
#define AUX_SCE_O_CTL                                               0x00000000

// Internal
#define AUX_SCE_O_FETCHSTAT                                         0x00000004

// Internal
#define AUX_SCE_O_CPUSTAT                                           0x00000008

// Internal
#define AUX_SCE_O_WUSTAT                                            0x0000000C

// Internal
#define AUX_SCE_O_REG1_0                                            0x00000010

// Internal
#define AUX_SCE_O_REG3_2                                            0x00000014

// Internal
#define AUX_SCE_O_REG5_4                                            0x00000018

// Internal
#define AUX_SCE_O_REG7_6                                            0x0000001C

// Internal
#define AUX_SCE_O_LOOPADDR                                          0x00000020

// Internal
#define AUX_SCE_O_LOOPCNT                                           0x00000024

// Non-Secure DDI Access 0
#define AUX_SCE_O_NONSECDDIACC0                                     0x00000028

// Non-Secure DDI Access 1
#define AUX_SCE_O_NONSECDDIACC1                                     0x0000002C

// Non-Secure DDI Access 2
#define AUX_SCE_O_NONSECDDIACC2                                     0x00000030

// Non-Secure DDI Access 3
#define AUX_SCE_O_NONSECDDIACC3                                     0x00000034

//*****************************************************************************
//
// Register: AUX_SCE_O_CTL
//
//*****************************************************************************
// Field: [31:24] FORCE_EV_LOW
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_CTL_FORCE_EV_LOW_W                                           8
#define AUX_SCE_CTL_FORCE_EV_LOW_M                                  0xFF000000
#define AUX_SCE_CTL_FORCE_EV_LOW_S                                          24

// Field: [23:16] FORCE_EV_HIGH
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_CTL_FORCE_EV_HIGH_W                                          8
#define AUX_SCE_CTL_FORCE_EV_HIGH_M                                 0x00FF0000
#define AUX_SCE_CTL_FORCE_EV_HIGH_S                                         16

// Field:  [15:8] RESET_VECTOR
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_CTL_RESET_VECTOR_W                                           8
#define AUX_SCE_CTL_RESET_VECTOR_M                                  0x0000FF00
#define AUX_SCE_CTL_RESET_VECTOR_S                                           8

// Field:     [6] DBG_FREEZE_EN
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_CTL_DBG_FREEZE_EN                                   0x00000040
#define AUX_SCE_CTL_DBG_FREEZE_EN_BITN                                       6
#define AUX_SCE_CTL_DBG_FREEZE_EN_M                                 0x00000040
#define AUX_SCE_CTL_DBG_FREEZE_EN_S                                          6

// Field:     [5] FORCE_WU_LOW
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_CTL_FORCE_WU_LOW                                    0x00000020
#define AUX_SCE_CTL_FORCE_WU_LOW_BITN                                        5
#define AUX_SCE_CTL_FORCE_WU_LOW_M                                  0x00000020
#define AUX_SCE_CTL_FORCE_WU_LOW_S                                           5

// Field:     [4] FORCE_WU_HIGH
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_CTL_FORCE_WU_HIGH                                   0x00000010
#define AUX_SCE_CTL_FORCE_WU_HIGH_BITN                                       4
#define AUX_SCE_CTL_FORCE_WU_HIGH_M                                 0x00000010
#define AUX_SCE_CTL_FORCE_WU_HIGH_S                                          4

// Field:     [3] RESTART
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_CTL_RESTART                                         0x00000008
#define AUX_SCE_CTL_RESTART_BITN                                             3
#define AUX_SCE_CTL_RESTART_M                                       0x00000008
#define AUX_SCE_CTL_RESTART_S                                                3

