espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_aux_sce.h
// Field:     [2] SINGLE_STEP
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_CTL_SINGLE_STEP                                     0x00000004
#define AUX_SCE_CTL_SINGLE_STEP_BITN                                         2
#define AUX_SCE_CTL_SINGLE_STEP_M                                   0x00000004
#define AUX_SCE_CTL_SINGLE_STEP_S                                            2

// Field:     [1] SUSPEND
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_CTL_SUSPEND                                         0x00000002
#define AUX_SCE_CTL_SUSPEND_BITN                                             1
#define AUX_SCE_CTL_SUSPEND_M                                       0x00000002
#define AUX_SCE_CTL_SUSPEND_S                                                1

// Field:     [0] CLK_EN
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_CTL_CLK_EN                                          0x00000001
#define AUX_SCE_CTL_CLK_EN_BITN                                              0
#define AUX_SCE_CTL_CLK_EN_M                                        0x00000001
#define AUX_SCE_CTL_CLK_EN_S                                                 0

//*****************************************************************************
//
// Register: AUX_SCE_O_FETCHSTAT
//
//*****************************************************************************
// Field: [31:16] OPCODE
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_FETCHSTAT_OPCODE_W                                          16
#define AUX_SCE_FETCHSTAT_OPCODE_M                                  0xFFFF0000
#define AUX_SCE_FETCHSTAT_OPCODE_S                                          16

// Field:  [15:0] PC
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_FETCHSTAT_PC_W                                              16
#define AUX_SCE_FETCHSTAT_PC_M                                      0x0000FFFF
#define AUX_SCE_FETCHSTAT_PC_S                                               0

//*****************************************************************************
//
// Register: AUX_SCE_O_CPUSTAT
//
//*****************************************************************************
// Field:    [11] BUS_ERROR
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_CPUSTAT_BUS_ERROR                                   0x00000800
#define AUX_SCE_CPUSTAT_BUS_ERROR_BITN                                      11
#define AUX_SCE_CPUSTAT_BUS_ERROR_M                                 0x00000800
#define AUX_SCE_CPUSTAT_BUS_ERROR_S                                         11

// Field:    [10] SLEEP
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_CPUSTAT_SLEEP                                       0x00000400
#define AUX_SCE_CPUSTAT_SLEEP_BITN                                          10
#define AUX_SCE_CPUSTAT_SLEEP_M                                     0x00000400
#define AUX_SCE_CPUSTAT_SLEEP_S                                             10

// Field:     [9] WEV
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_CPUSTAT_WEV                                         0x00000200
#define AUX_SCE_CPUSTAT_WEV_BITN                                             9
#define AUX_SCE_CPUSTAT_WEV_M                                       0x00000200
#define AUX_SCE_CPUSTAT_WEV_S                                                9

// Field:     [8] HALTED
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_CPUSTAT_HALTED                                      0x00000100
#define AUX_SCE_CPUSTAT_HALTED_BITN                                          8
#define AUX_SCE_CPUSTAT_HALTED_M                                    0x00000100
#define AUX_SCE_CPUSTAT_HALTED_S                                             8

// Field:     [3] V_FLAG
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_CPUSTAT_V_FLAG                                      0x00000008
#define AUX_SCE_CPUSTAT_V_FLAG_BITN                                          3
#define AUX_SCE_CPUSTAT_V_FLAG_M                                    0x00000008
#define AUX_SCE_CPUSTAT_V_FLAG_S                                             3

// Field:     [2] C_FLAG
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_CPUSTAT_C_FLAG                                      0x00000004
#define AUX_SCE_CPUSTAT_C_FLAG_BITN                                          2
#define AUX_SCE_CPUSTAT_C_FLAG_M                                    0x00000004
#define AUX_SCE_CPUSTAT_C_FLAG_S                                             2

// Field:     [1] N_FLAG
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_CPUSTAT_N_FLAG                                      0x00000002
#define AUX_SCE_CPUSTAT_N_FLAG_BITN                                          1
#define AUX_SCE_CPUSTAT_N_FLAG_M                                    0x00000002
#define AUX_SCE_CPUSTAT_N_FLAG_S                                             1

// Field:     [0] Z_FLAG
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_CPUSTAT_Z_FLAG                                      0x00000001
#define AUX_SCE_CPUSTAT_Z_FLAG_BITN                                          0
#define AUX_SCE_CPUSTAT_Z_FLAG_M                                    0x00000001
#define AUX_SCE_CPUSTAT_Z_FLAG_S                                             0

//*****************************************************************************
//
// Register: AUX_SCE_O_WUSTAT
//
//*****************************************************************************
// Field: [18:16] EXC_VECTOR
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_WUSTAT_EXC_VECTOR_W                                          3
#define AUX_SCE_WUSTAT_EXC_VECTOR_M                                 0x00070000
#define AUX_SCE_WUSTAT_EXC_VECTOR_S                                         16

// Field:     [8] WU_SIGNAL
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_WUSTAT_WU_SIGNAL                                    0x00000100
#define AUX_SCE_WUSTAT_WU_SIGNAL_BITN                                        8
#define AUX_SCE_WUSTAT_WU_SIGNAL_M                                  0x00000100
#define AUX_SCE_WUSTAT_WU_SIGNAL_S                                           8

// Field:   [7:0] EV_SIGNALS
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// SCEWEV_PROG              Internal. Only to be used through TI provided API.
// AUX_ADC_FIFO_NOT_EMPTY   Internal. Only to be used through TI provided API.
// AUX_TIMER1_EV_OR_IDLE    Internal. Only to be used through TI provided API.
// AUX_TIMER0_EV_OR_IDLE    Internal. Only to be used through TI provided API.
// AUX_TDC_DONE             Internal. Only to be used through TI provided API.
// AUX_COMPB                Internal. Only to be used through TI provided API.
// AUX_COMPA                Internal. Only to be used through TI provided API.
// AUX_PROG_DLY_IDLE        Internal. Only to be used through TI provided API.
#define AUX_SCE_WUSTAT_EV_SIGNALS_W                                          8
#define AUX_SCE_WUSTAT_EV_SIGNALS_M                                 0x000000FF
#define AUX_SCE_WUSTAT_EV_SIGNALS_S                                          0
#define AUX_SCE_WUSTAT_EV_SIGNALS_SCEWEV_PROG                       0x00000080
#define AUX_SCE_WUSTAT_EV_SIGNALS_AUX_ADC_FIFO_NOT_EMPTY            0x00000040
#define AUX_SCE_WUSTAT_EV_SIGNALS_AUX_TIMER1_EV_OR_IDLE             0x00000020
#define AUX_SCE_WUSTAT_EV_SIGNALS_AUX_TIMER0_EV_OR_IDLE             0x00000010
#define AUX_SCE_WUSTAT_EV_SIGNALS_AUX_TDC_DONE                      0x00000008
#define AUX_SCE_WUSTAT_EV_SIGNALS_AUX_COMPB                         0x00000004
#define AUX_SCE_WUSTAT_EV_SIGNALS_AUX_COMPA                         0x00000002
#define AUX_SCE_WUSTAT_EV_SIGNALS_AUX_PROG_DLY_IDLE                 0x00000001

//*****************************************************************************
//
// Register: AUX_SCE_O_REG1_0
//
//*****************************************************************************
// Field: [31:16] REG1
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_REG1_0_REG1_W                                               16
#define AUX_SCE_REG1_0_REG1_M                                       0xFFFF0000
#define AUX_SCE_REG1_0_REG1_S                                               16

// Field:  [15:0] REG0
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_REG1_0_REG0_W                                               16
#define AUX_SCE_REG1_0_REG0_M                                       0x0000FFFF
#define AUX_SCE_REG1_0_REG0_S                                                0

//*****************************************************************************
//
// Register: AUX_SCE_O_REG3_2
//
//*****************************************************************************
// Field: [31:16] REG3
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_REG3_2_REG3_W                                               16
#define AUX_SCE_REG3_2_REG3_M                                       0xFFFF0000
#define AUX_SCE_REG3_2_REG3_S                                               16

// Field:  [15:0] REG2
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_REG3_2_REG2_W                                               16
#define AUX_SCE_REG3_2_REG2_M                                       0x0000FFFF
#define AUX_SCE_REG3_2_REG2_S                                                0

//*****************************************************************************
//
// Register: AUX_SCE_O_REG5_4
//
//*****************************************************************************
// Field: [31:16] REG5
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_REG5_4_REG5_W                                               16
#define AUX_SCE_REG5_4_REG5_M                                       0xFFFF0000
#define AUX_SCE_REG5_4_REG5_S                                               16

// Field:  [15:0] REG4
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_REG5_4_REG4_W                                               16
#define AUX_SCE_REG5_4_REG4_M                                       0x0000FFFF
#define AUX_SCE_REG5_4_REG4_S                                                0

//*****************************************************************************
//
// Register: AUX_SCE_O_REG7_6
//
//*****************************************************************************
// Field: [31:16] REG7
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_REG7_6_REG7_W                                               16
#define AUX_SCE_REG7_6_REG7_M                                       0xFFFF0000
#define AUX_SCE_REG7_6_REG7_S                                               16

// Field:  [15:0] REG6
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_REG7_6_REG6_W                                               16
#define AUX_SCE_REG7_6_REG6_M                                       0x0000FFFF
#define AUX_SCE_REG7_6_REG6_S                                                0

//*****************************************************************************
//
// Register: AUX_SCE_O_LOOPADDR
//
//*****************************************************************************
// Field: [31:16] STOP
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_LOOPADDR_STOP_W                                             16
#define AUX_SCE_LOOPADDR_STOP_M                                     0xFFFF0000
#define AUX_SCE_LOOPADDR_STOP_S                                             16

// Field:  [15:0] START
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_LOOPADDR_START_W                                            16
#define AUX_SCE_LOOPADDR_START_M                                    0x0000FFFF
#define AUX_SCE_LOOPADDR_START_S                                             0

//*****************************************************************************
//
// Register: AUX_SCE_O_LOOPCNT
//
//*****************************************************************************
// Field:   [7:0] ITER_LEFT
//
// Internal. Only to be used through TI provided API.
#define AUX_SCE_LOOPCNT_ITER_LEFT_W                                          8
#define AUX_SCE_LOOPCNT_ITER_LEFT_M                                 0x000000FF
#define AUX_SCE_LOOPCNT_ITER_LEFT_S                                          0

//*****************************************************************************
//
// Register: AUX_SCE_O_NONSECDDIACC0
//
//*****************************************************************************
// Field:    [22] RD_EN
//
// Read Enable
//
// 0: AUX_SCE is not allowed to read DDI half-word given by ADDR.
// 1: AUX_SCE is allowed to read DDI half-word given by ADDR.
#define AUX_SCE_NONSECDDIACC0_RD_EN                                 0x00400000
#define AUX_SCE_NONSECDDIACC0_RD_EN_BITN                                    22
#define AUX_SCE_NONSECDDIACC0_RD_EN_M                               0x00400000
#define AUX_SCE_NONSECDDIACC0_RD_EN_S                                       22

// Field: [21:16] ADDR
//
// Address
//
// AUX_SCE is allowed to uppdate this DDI half-word using SET or CLR access.
#define AUX_SCE_NONSECDDIACC0_ADDR_W                                         6
#define AUX_SCE_NONSECDDIACC0_ADDR_M                                0x003F0000
#define AUX_SCE_NONSECDDIACC0_ADDR_S                                        16

// Field:  [15:0] WR_MASK
//
// Mask
//
// AUX_SCE is allowed to update bits in half-word given by ADDR according to
// this bit mask.
#define AUX_SCE_NONSECDDIACC0_WR_MASK_W                                     16
#define AUX_SCE_NONSECDDIACC0_WR_MASK_M                             0x0000FFFF
#define AUX_SCE_NONSECDDIACC0_WR_MASK_S                                      0

//*****************************************************************************
//
// Register: AUX_SCE_O_NONSECDDIACC1
//
//*****************************************************************************
// Field:    [22] RD_EN
//
// Read Enable
//
// 0: AUX_SCE is not allowed to read DDI half-word given by ADDR.
// 1: AUX_SCE is allowed to read DDI half-word given by ADDR.
#define AUX_SCE_NONSECDDIACC1_RD_EN                                 0x00400000
#define AUX_SCE_NONSECDDIACC1_RD_EN_BITN                                    22
#define AUX_SCE_NONSECDDIACC1_RD_EN_M                               0x00400000
#define AUX_SCE_NONSECDDIACC1_RD_EN_S                                       22

// Field: [21:16] ADDR
//
// Address
//
// AUX_SCE is allowed to uppdate this DDI half-word using SET or CLR access.
#define AUX_SCE_NONSECDDIACC1_ADDR_W                                         6
#define AUX_SCE_NONSECDDIACC1_ADDR_M                                0x003F0000
#define AUX_SCE_NONSECDDIACC1_ADDR_S                                        16

// Field:  [15:0] WR_MASK
//
// Mask
//
// AUX_SCE is allowed to update bits in half-word given by ADDR according to
// this bit mask.
#define AUX_SCE_NONSECDDIACC1_WR_MASK_W                                     16
#define AUX_SCE_NONSECDDIACC1_WR_MASK_M                             0x0000FFFF
#define AUX_SCE_NONSECDDIACC1_WR_MASK_S                                      0

//*****************************************************************************
//
// Register: AUX_SCE_O_NONSECDDIACC2
//
//*****************************************************************************
// Field:    [22] RD_EN
//
// Read Enable
//
// 0: AUX_SCE is not allowed to read DDI half-word given by ADDR.
// 1: AUX_SCE is allowed to read DDI half-word given by ADDR.
#define AUX_SCE_NONSECDDIACC2_RD_EN                                 0x00400000
#define AUX_SCE_NONSECDDIACC2_RD_EN_BITN                                    22
#define AUX_SCE_NONSECDDIACC2_RD_EN_M                               0x00400000
#define AUX_SCE_NONSECDDIACC2_RD_EN_S                                       22

// Field: [21:16] ADDR
//
// Address
//
// AUX_SCE is allowed to uppdate this DDI half-word using SET or CLR access.
#define AUX_SCE_NONSECDDIACC2_ADDR_W                                         6
#define AUX_SCE_NONSECDDIACC2_ADDR_M                                0x003F0000
#define AUX_SCE_NONSECDDIACC2_ADDR_S                                        16

// Field:  [15:0] WR_MASK
//
// Mask
//
// AUX_SCE is allowed to update bits in half-word given by ADDR according to
// this bit mask.
#define AUX_SCE_NONSECDDIACC2_WR_MASK_W                                     16
#define AUX_SCE_NONSECDDIACC2_WR_MASK_M                             0x0000FFFF
#define AUX_SCE_NONSECDDIACC2_WR_MASK_S                                      0

//*****************************************************************************
//
// Register: AUX_SCE_O_NONSECDDIACC3
//
//*****************************************************************************
// Field:    [22] RD_EN
//
// Read Enable
//
// 0: AUX_SCE is not allowed to read DDI half-word given by ADDR.
// 1: AUX_SCE is allowed to read DDI half-word given by ADDR.
#define AUX_SCE_NONSECDDIACC3_RD_EN                                 0x00400000
#define AUX_SCE_NONSECDDIACC3_RD_EN_BITN                                    22
#define AUX_SCE_NONSECDDIACC3_RD_EN_M                               0x00400000
#define AUX_SCE_NONSECDDIACC3_RD_EN_S                                       22

// Field: [21:16] ADDR
//
// Address
//
// AUX_SCE is allowed to uppdate this DDI half-word using SET or CLR access.
#define AUX_SCE_NONSECDDIACC3_ADDR_W                                         6
#define AUX_SCE_NONSECDDIACC3_ADDR_M                                0x003F0000
#define AUX_SCE_NONSECDDIACC3_ADDR_S                                        16

// Field:  [15:0] WR_MASK
//
// Mask
//
// AUX_SCE is allowed to update bits in half-word given by ADDR according to
// this bit mask.
#define AUX_SCE_NONSECDDIACC3_WR_MASK_W                                     16
#define AUX_SCE_NONSECDDIACC3_WR_MASK_M                             0x0000FFFF
#define AUX_SCE_NONSECDDIACC3_WR_MASK_S                                      0


#endif // __AUX_SCE__
